//Задача 43. Написать программу преобразования десятичного числа в двоичное
/* Console.Clear();
Console.Write("Введите двоичное число: ");
int b = int.Parse(Console.ReadLine());
string s = Convert.ToString(b, 2);
Console.WriteLine(s); */
